; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v7 ?v10)
             (pred_11 ?v12 ?v8)
             (pred_2 ?v7 ?v8)
             (pred_4 ?v9 ?v7 )
	     (pred_8 ?v7)
             (pred_3 ?v6)
             (pred_5 ?v12)
             (pred_1 ?v8)
             (pred_10 ?v7)
             (pred_6 ?v12)
             (pred_12 ?v7)
             (pred_7 ))



(:action op_3
:parameters (?v4 ?v3 ?v11 ?v5)
:precondition (and (pred_3 ?v4) (pred_3 ?v3) (pred_5 ?v11) (pred_1 ?v5)
          (pred_9 ?v4 ?v3) (pred_11 ?v11 ?v5)
                   (pred_2 ?v3 ?v5) (pred_8 ?v4) 
                   (pred_10 ?v3) (pred_6 ?v11))
:effect (and  (pred_12 ?v3) (not (pred_10 ?v3))))


(:action op_2
:parameters (?v4 ?v2)
:precondition (and (pred_3 ?v4) (pred_3 ?v2)
               (pred_8 ?v4) (pred_9 ?v4 ?v2) (pred_12 ?v2))
:effect (and (pred_8 ?v2) (not (pred_8 ?v4))))

(:action op_4
:parameters (?v4 ?v11)
:precondition (and (pred_3 ?v4) (pred_5 ?v11) 
                  (pred_8 ?v4) (pred_4 ?v11 ?v4) (pred_7 ))
:effect (and (pred_6 ?v11)
   (not (pred_4 ?v11 ?v4)) (not (pred_7 ))))


(:action op_5
:parameters (?v4 ?v13 ?v1)
:precondition (and (pred_3 ?v4) (pred_5 ?v13) (pred_5 ?v1)
                  (pred_8 ?v4) (pred_6 ?v1) (pred_4 ?v13 ?v4))
:effect (and (pred_6 ?v13) (pred_4 ?v1 ?v4)
        (not (pred_6 ?v1)) (not (pred_4 ?v13 ?v4))))

(:action op_1
:parameters (?v4 ?v11)
:precondition (and (pred_3 ?v4) (pred_5 ?v11) 
                  (pred_8 ?v4) (pred_6 ?v11))
:effect (and (pred_7 ) (pred_4 ?v11 ?v4) (not (pred_6 ?v11)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_04 obj_09 obj_10 obj_08 obj_17 obj_03 obj_06 obj_14 obj_20 obj_02 obj_11 obj_13 obj_15 obj_19 obj_18 obj_01
    obj_07 obj_16
    obj_05 obj_12
    )

    (:init
       (pred_7)

       (pred_3 obj_04)
       (pred_3 obj_09)
       (pred_3 obj_10)
       (pred_3 obj_08)
       (pred_3 obj_17)
       (pred_3 obj_03)
       (pred_3 obj_06)
       (pred_3 obj_14)
       (pred_3 obj_20)
       (pred_3 obj_02)
       (pred_3 obj_11)
       (pred_3 obj_13)
       (pred_3 obj_15)
       (pred_3 obj_19)
       (pred_3 obj_18)
       (pred_3 obj_01)
       (pred_1 obj_07)
       (pred_1 obj_16)
       (pred_5 obj_05)
       (pred_5 obj_12)

       (pred_9 obj_04 obj_17)
       (pred_9 obj_04 obj_09)
       (pred_9 obj_09 obj_03)
       (pred_9 obj_09 obj_10)
       (pred_9 obj_09 obj_04)
       (pred_9 obj_10 obj_06)
       (pred_9 obj_10 obj_08)
       (pred_9 obj_10 obj_09)
       (pred_9 obj_08 obj_14)
       (pred_9 obj_08 obj_10)
       (pred_9 obj_17 obj_20)
       (pred_9 obj_17 obj_03)
       (pred_9 obj_17 obj_04)
       (pred_9 obj_03 obj_02)
       (pred_9 obj_03 obj_06)
       (pred_9 obj_03 obj_09)
       (pred_9 obj_03 obj_17)
       (pred_9 obj_06 obj_11)
       (pred_9 obj_06 obj_14)
       (pred_9 obj_06 obj_10)
       (pred_9 obj_06 obj_03)
       (pred_9 obj_14 obj_13)
       (pred_9 obj_14 obj_08)
       (pred_9 obj_14 obj_06)
       (pred_9 obj_20 obj_15)
       (pred_9 obj_20 obj_02)
       (pred_9 obj_20 obj_17)
       (pred_9 obj_02 obj_19)
       (pred_9 obj_02 obj_11)
       (pred_9 obj_02 obj_03)
       (pred_9 obj_02 obj_20)
       (pred_9 obj_11 obj_18)
       (pred_9 obj_11 obj_13)
       (pred_9 obj_11 obj_06)
       (pred_9 obj_11 obj_02)
       (pred_9 obj_13 obj_01)
       (pred_9 obj_13 obj_14)
       (pred_9 obj_13 obj_11)
       (pred_9 obj_15 obj_19)
       (pred_9 obj_15 obj_20)
       (pred_9 obj_19 obj_18)
       (pred_9 obj_19 obj_02)
       (pred_9 obj_19 obj_15)
       (pred_9 obj_18 obj_01)
       (pred_9 obj_18 obj_11)
       (pred_9 obj_18 obj_19)
       (pred_9 obj_01 obj_13)
       (pred_9 obj_01 obj_18)
       (pred_10 obj_20)
       (pred_10 obj_08)
       (pred_2  obj_20 obj_07)
       (pred_2  obj_08 obj_16)
       (pred_12 obj_04)
       (pred_12 obj_09)
       (pred_12 obj_10)
       (pred_12 obj_17)
       (pred_12 obj_03)
       (pred_12 obj_06)
       (pred_12 obj_14)
       (pred_12 obj_02)
       (pred_12 obj_11)
       (pred_12 obj_13)
       (pred_12 obj_15)
       (pred_12 obj_19)
       (pred_12 obj_18)
       (pred_12 obj_01)

       (pred_11  obj_05 obj_07)
       (pred_11  obj_12 obj_16)
       (pred_4 obj_05 obj_11)
       (pred_4 obj_12 obj_06)
       (pred_8 obj_19)
    )

    (:goal (and
       (pred_4 obj_05 obj_19)
    ))
(:constraints
  (always (not (pred_8 obj_02)))
)
)

; plan
1. (op_2 obj_19 obj_18)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_18)
   goals met: 0 of 1
2. (op_2 obj_18 obj_11)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_11)
   goals met: 0 of 1
3. (op_4 obj_11 obj_05)
   deleted: (pred_4 obj_05 obj_11) (pred_7)
   added: (pred_6 obj_05)
   goals met: 0 of 1
4. (op_2 obj_11 obj_18)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_18)
   goals met: 0 of 1
5. (op_2 obj_18 obj_19)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_19)
   goals met: 0 of 1
6. (op_1 obj_19 obj_05)
   deleted: (pred_6 obj_05)
   added: (pred_7) (pred_4 obj_05 obj_19)
   goals met: 1 of 1
